<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"local","plan_modifier":"051a6df03c1b94ddb53b9a5329a560edecfe2c5bcd6a6a36ac0b75d175265fcb","backend":"b9f162f87a7702e1a27a12145c8eaaae001b2af7b1689d13a9c12a3dfe240742","plan_job_ref":"Job Test actions using target and replace #451 at https://github.com/dflook/terraform-github-actions/actions/runs/12764963863","plan_out_hash":"24afeddb507a84a379f18a47c4445a8e392f28abc1df444c60b77e6c1634613a","plan_hash":"0636aa03ed695fb1b54dcdfccfeac535ca44bcddf1429bb16ae3dc33b6db8cc2","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-target-replace__
Replacing resources: `random_string.foreach["hello"]`, `random_string.count[0]`
With variables: `length = 10`
<details>
<summary>Plan: 2 to add, 0 to change, 2 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # random_string.count[0] will be replaced, as requested
-/+ resource "random_string" "count" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

  # random_string.foreach["hello"] will be replaced, as requested
-/+ resource "random_string" "foreach" {
!~      id          = "**********" -> (known after apply)
!~      result      = "**********" -> (known after apply)
#        (10 unchanged attributes hidden)
    }

Plan: 2 to add, 0 to change, 2 to destroy.

Changes to Outputs:
!~  count   = "mvK9TRyxOH" -> (known after apply)
!~  foreach = "ngVNpTkJV1" -> (known after apply)
```
</details>

:memo: Plan generated in [Test actions using target and replace #451](https://github.com/dflook/terraform-github-actions/actions/runs/12764963863)